---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointOnEdgeEdgeIntersection
source: html/dec2f2ab-cd2a-54ea-2d91-890310660db0.htm
---
# PointOnEdgeEdgeIntersection Methods

Get a copy of the first edge or curve reference.